Terraform Plan for terraform/eus/dev/frontend:

```
azurerm_storage_blob.site["assets/index-eNdnZDPu.js"]: Refreshing state... [id=https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-eNdnZDPu.js]
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_container_app_environment.aca_env: Read complete after 0s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.frontend will be created
  + resource "azurerm_container_app" "frontend" {
      + container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "opre-ops-dev-eus-fe-ca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "opre-ops-dev-eus-core-rg"
      + revision_mode                 = "Multiple"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = "0896fc51"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/hhs/opre-ops/ops-frontend:0896fc516edce3b1791fa1bd0869d1e16b34bb5f"
              + memory            = "0.5Gi"
              + name              = "ops-frontend"

              + env {
                  + name  = "REACT_APP_BACKEND_DOMAIN"
                  + value = "https://opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
                }
            }
        }
    }

  # azurerm_storage_blob.site["assets/index-eNdnZDPu.js"] will be destroyed
  # (because azurerm_storage_blob.site is not in configuration)
  - resource "azurerm_storage_blob" "site" {
      - access_tier            = "Hot" -> null
      - content_md5            = "b074b69b1bf65e1729a2216c0d29dacb" -> null
      - content_type           = "application/javascript" -> null
      - id                     = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-eNdnZDPu.js" -> null
      - metadata               = {} -> null
      - name                   = "assets/index-eNdnZDPu.js" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "../../../../frontend/build/assets/index-eNdnZDPu.js" -> null
      - storage_account_name   = "opreopsdeveussfest" -> null
      - storage_container_name = "$web" -> null
      - type                   = "Block" -> null
      - url                    = "https://opreopsdeveussfest.blob.core.windows.net/$web/assets/index-eNdnZDPu.js" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ domain = "https://opreopsdeveussfest.z13.web.core.windows.net" -> "https://opre-ops-dev-eus-fe-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
```

Plan saved to GH artifacts.